export let course = [
    {
        id: 1,
        note: 'Курс доступен всем пользователям',
        title: 'Как ходят фигуры',
        body: 'Узнаем, как ходят фигуры, и как расставить их на доске!\n' +
            'Хотите узнать о правилах королевской игры? Сыграть в шахматы с другом или родственником? Тогда этот курс для вас! Пройдя этот курс, вы сможете расставить фигуры на доске и сможете сыграть в шахматы!\n' +
            'Вы узнаете:\n' +
            'Как расставить фигуры на доске\n' +
            'Что такое превращение пешки, и как его осуществить\n' +
            'Ходы каждой фигуры\n' +
            'Как дать мат и выиграть партию!\n',
        img: '../images/new/1.png',
        link: '/base'
    },
    {
        id: 2,
        note: 'Курс доступен авторизированным пользователям',
        title: 'Пора играть',
        body: 'Мы узнали, как ходят фигуры, и можем расставить их на доске. Что делать дальше? Узнать правила игры! Этот курс предназначен тем,  кто хочет сыграть партию в шахматы от начала до конца. Пройдя его до конца, вы сможете сыграть с кем угодно!\n' +
            'Вы узнаете:\n' +
            'Разницу между шахом и матом\n' +
            'О пате и других видах ничьих\n' +
            'Основы стратегии, такие как взятие фигур\n' +
            'О рокировке, взятии на проходе и более сложных правилах!\n',
        img: '../images/new/2.png',
        link: '/adv'
    },
    {
        id: 3,
        note: '',
        title: 'Введение в теорию дебютов',
        body: '!!!Скоро появится!!!',
        img: '../images/new/3.png',
        link: '/'
    },
    {
        id: 4,
        note: '',
        title: 'Основы тактики',
        body: '!!!Скоро появится!!!',
        img: '../images/new/4.png',
        link: '/'
    },

    {
        id: 5,
        note: '',
        title: 'Дебютные принципы',
        body: '!!!Скоро появится!!!',
        img: '../images/new/5.png',
        link: '/'
    },
    {
        id: 6,
        note: '',
        title: 'Охотимся на фигуры',
        body: '!!!Скоро появится!!!',
        img: '../images/new/15.png',
        link: '/'

    },
    {
        id: 7,
        note: '',
        title: 'Форсированная игра',
        body: '!!!Скоро появится!!!',
        img: '../images/new/16.png',
        link: '/'

    },
    {
        id: 8,
        note: '',
        title: 'Основы эндшпиля',
        body: '!!!Скоро появится!!!',
        img: '../images/new/8.png',
        link: '/'
    },
    {
        id: 9,
        note: '',
        title: 'Охотимся на короля',
        body: '!!!Скоро появится!!!',
        img: '../images/new/9.png',
        link: '/'
    },

    {
        id: 10,
        note: '',
        title: 'Тактика',
        body: '!!!Скоро появится!!!',
        img: '../images/new/10.png',
        link: '/'
    },
    {
        id: 11,
        note: '',
        title: 'Секреты эндшпиля',
        body: '!!!Скоро появится!!!',
        img: '../images/new/11.png',
        link: '/'
   },
    {
        id: 12,
        note: '',
        title: 'Основы стратегии',
        body: '!!!Скоро появится!!!',
        img: '../images/new/12.png',
        link: '/'
    },
    {
        id: 13,
        note: '',
        title: 'Ставим мат',
        body: '!!!Скоро появится!!!',
        img: '../images/new/13.png',
        link: '/'
    },
    {
        id: 14,
        note: '',
        title: 'Активизируем фигуры',
        body: '!!!Скоро появится!!!',
        img: '../images/new/14.png',
        link: '/'
    },
    {
        id: 15,
        note: '',
        title: 'Дебют, продолжение',
        body: '!!!Скоро появится!!!',
        img: '../images/new/6.png',
        link: '/'
   },
    {
        id: 16,
        note: '',
        title: 'Эндшпиль, продолжение',
        body: '!!!Скоро появится!!!',
        img: '../images/new/7.png',
        link: '/'
    },
    {
        id: 17,
        note: '',
        title: 'Стратегия, продолжение',
        body: '!!!Скоро появится!!!',
        img: '../images/new/17.png',
        link: '/'
    },
    {
        id: 18,
        note: '',
        title: 'Атака на короля',
        body: '!!!Скоро появится!!!',
        img: '../images/new/18.png',
        link: '/'
    }


]


