export let lessons = [
    {
        id: 1,
        title: 'Король и цель игры',
        body: 'Шахматы - увлекательная игра, которую легко освоить. В нее играют 32 фигурами на доске 8x8 из 64 полей. Победа достигается матом - поимкой короля противника. Король - самая важная, но не самая сильная фигура. Король может ходить на любое соседнее поле по вертикали, горизонтали или диагонали.',
        img: '../images/base_1_the-king-and-the-goal.png',
        video: '../video/base_1_the-king-and-the-goal.mp4'
        },
    {
        id: 2,
        title: 'Ферзь',
        body: 'Король - самая важная шахматная фигура, но ферзь - самая сильная. Как и король, ферзь может ходить в любом направлении: вперед, назад, вбок или по диагонали, но в отличие от короля ферзь перемещается на сколько угодно полей. Одно ограничение: он не может перепрыгивать через фигуры, стоящие у него на пути.',
        img: '../images/base_2_the-queen.png',
        video: '../video/base_2_the-queen.mp4'
    },
    {
        id: 3,
        title: 'Ладья',
        body: 'Ладья может ходить вперед, назад и в стороны как ферзь, но не может ходить по диагонали.',
        img: '../images/base_3_the-rook.png',
        video: '../video/base_3_the-rook.mp4'
    },
    {
        id: 4,
        title: 'Слон',
        body: 'Слон может ходить по диагонали как ферзь, но не вперед, назад или в стороны. У каждого из противников в начале партии два слона: один белопольный, и один ',
        img: '../images/base_4_the-bishop.png',
        video: '../video/base_4_the-bishop.mp4'
    },

    {
        id: 5,
        title: 'Конь',
        body: 'Конь - единственная шахматная фигура, которая ходит не по прямой линии. При ходе конь двигается два поле в одном направлении и на одно в перпендикулярном. Например, на два поля вперед и на одно влево, или на два поля вправо и на одно вниз. Ход коня похож на букву "Г". Также конь отличается тем, что это - единственная фигура, способная перепрыгивать через препятствия.',
        img: '../images/base_5_the-knight.png',
        video: '../video/base_5_the-knight.mp4'
    },
    {
        id: 6,
        title: 'Пешка',
        body: 'Обычно за один ход пешка может продвинуться на одно поле вперед. Но у пешек есть и особые свойства. На первом ходу пешка может продвинуться на одно или на два поля. Кроме того, взятие пешки отличается от обычного хода. Пешка может взять фигуру, расположенную впереди от нее по диагонали. Пешки - единственные фигуры, которые не могут отступать назад.',
        img: '../images/base_6_the-pawn.png',
        video: '../video/base_6_the-pawn.mp4'
    },
    {
        id: 7,
        title: 'Пешечное превращение',
        body: 'Добравшись до последней горизонтали, пешка может превратиться, то есть, стать любой фигурой: конем, слоном, ладьей или ферзем. Ферзи - самые важные фигуры, и превращение в ферзя встречается чаще всего.',
        img: '../images/base_7_pawn-promotion.png',
        video: '../video/base_7_pawn-promotion.mp4'
    },
    {
        id: 8,
        title: 'Начальная расстановка',
        body: 'Теперь мы знаем, как ходят фигуры - пора расставить их и начать партию. Доска должна быть расположена так, чтобы справа внизу от каждого из игроков было белое поле. Ладьи располагаются в углах доски, рядом с ними кони, потом слоны. Король и ферзи находятся в центре последней и первой горизонтали, при этом ферзи - на поле цвета своих фигур. Все пешки белых расположены на второй горизонтали, а все пешки черных - на седьмой.',
        img: '../images/base_8_setting-up-the-board.png',
        video: '../video/base_8_setting-up-the-board.mp4'
    },
    {
        id: 9,
        title: 'Язык шахмат',
        body: 'У каждого поля на шахматной доске есть свое имя, состоящее из двух координат. Каждая вертикаль обозначается определенной латинской буквой, начиная с "а", где расположена ферзевая ладья и заканчивая "h", где находится королевская. Каждая горизонталь обозначается определенной цифрой: на 1-й и 2-й стоят фигуры белых, а на 7-й и 8-й - фигуры черных. Каждая фигура обозначается так: король = Кр, ферзь = Ф, ладья = Л, слон = С, конь = К, а у пешек обозначение пропускается.',
        img: '../images/base_9_notation.png',
        video: '../video/base_9_notation.mp4'
    },

    {
        id: 10,
        title: 'Ходы и взятия',
        body: 'Мы приблизимся к победе в шахматной партии, если заберем все фигуры противника. Большинство фигур делает взятия так же, как ходит. Только пешки берут вперед по диагонали, а ходят вперед прямо. Символ взятия - буква "x" или двоеточие между буквенным обозначением фигуры и полем, где она оказывается. Например, взятие ферзем на a2 записывается как Фxa2. Превращение пешки обозначается знаком "=" и обозначением новой фигуры. Например, мы записываем превращение пешки в ферзя на поле d8 как d8=Ф.',
        img: '../images/base_10_moving-and-capturing.png',
        video: '../video/base_10_moving-and-capturing.mp4'
    },
    {
        id: 11,
        title: 'Даем шах',
        body: 'Шах значит, что один из игроков угрожает взять вражеского короля. Взятие короля в шахматах невозможно по правилам, поэтому от шаха нужно защититься. Шах обозначается символом "+" в конце нотации. Например, ход конем на g6 с шахом обозначается ходом Кg6+.',
        img: '../images/adv_1_check.png',
        video: '../video/adv_1_check.mp4'
    },
    {
        id: 12,
        title: 'Защита от шаха',
        body: 'Когда нам шах, от него нужно защититься. Для этого можно отступить королем, закрыться другой фигурой или взять фигуру, объявившую шах.',
        img: '../images/adv_2_getting-out-of-check.png',
        video: '../video/adv_2_getting-out-of-check.mp4'
    },
    {
        id: 13,
        title: 'Даем мат',
        body: 'Мы побеждаем, если король нашего противника под шахом и не может отступить. Это мат!',
        img: '../images/adv_3_checkmate.png',
        video: '../video/adv_3_checkmate.mp4'
    },
    {
        id: 14,
        title: 'Самый быстрый мат',
        body: 'Задумывались когда-нибудь, как на доске может возникнуть самый быстрый мат? Для этого нужно всего два хода. Смотрим: 1. f3 e5 2. g4 Фh4#. Мат обозначается символом #.',
        img: '../images/adv_4_fastest-checkmate.png',
        video: '../video/adv_4_fastest-checkmate.mp4'
    },
    {
        id: 15,
        title: 'Ничья патом',
        body: 'Пат возникает на доске, когда у одного из противников нет возможных ходов, но его король не находится под шахом. Пат ведет к ничьей даже, если у другого игрока подавляющее материальное преимущество. Пример пата: король одного из противников не находится под шахом, но получит шах на любом соседнем поле.',
        img: '../images/adv_5_stalemate.png',
        video: '../video/adv_5_stalemate.mp4'
    },
    {
        id: 16,
        title: 'Другие ничьи',
        body: 'Не все партии завершаются результативно, победой или поражением. Иногда они заканчиваются вничью. Возможны следующие причины ничьи: 1. Пат. 2. Соглашение противников. 3. При троекратном повторении позиции любой из противников может потребовать признания партии ничьей. 4. Если на протяжении 50 ходов не делалось ходов пешками или взятий.',
        img: '../images/adv_6_drawing.png',
        video: '../video/adv_6_drawing.mp4'
    },
    {
        id: 17,
        title: 'Взятие на проходе',
        body: 'Это самое необычное правило в шахматах - убедимся, что оно нам знакомо. Взятие на проходе возможно после хода пешки на два поля вперед. Ответным ходом противник может взять эту пешку, если поле, которое перешагнула ранее не ходившая пешка, под боем у его пешки. Если черная пешка расположена на g7, а белая на h5, и черная пешка идет на g5, белая может ее взять, оказавшись на поле g6. Это возможно только на ответном ходу. После другого хода право взятия пешки на проходе теряется.',
        img: '../images/adv_7_en-passant.png',
        video: '../video/adv_7_en-passant.mp4'
    },
    {
        id: 18,
        title: 'Рокировка',
        body: 'Рокировка - особый ход, позволяющий обезопасить короля и активизировать ладью. Это единственный раз в шахматной партии, когда двигаются одновременно две фигуры. Король делает шаг на два поля вправо или влево, а ладья располагается с другого края от короля. Рокировка возможна, если ни король, ни ладья еще не ходили, и у них на пути нет других фигур. Нельзя рокировать из-под шаха, под шах или через шах.',
        img: '../images/adv_8_castling.png',
        video: '../video/adv_8_castling.mp4'
    },

    {
        id: 19,
        title: 'Как найти сильный ход?',
        body: 'На каждом ходу возможны десятки продолжений. Как выбрать сильнейшее? Оценим свои возможности и угрозы противника. Обратим особое внимание на шахи, взятия и угрозы.',
        img: '../images/adv_9_smart-moves.png',
        video: '../video/adv_9_smart-moves.mp4'
    },
    {
        id: 20,
        title: 'Как происходит партия?',
        body: 'Смотрим партию от начала до конца с объяснением всех ходов. 1. e4 c6 Противники выводят пешки в центр. 2. d4 d5 Заняв центр двумя пешками, можно развивать фигуры. 3. Кc3 dxe4 Белые защищают пешку, а черные ее берут. 4. Кxe4 Кd7 Белые берут в ответ, а черные развивают коня. 5. Bc4 Кgf6 Белые выводят слона, а черные - коня. 6. Ng5 h6 Белые нападают на пешку f7, но черные не замечают угрозу. 7. Bf7# Мат!',
        img: '../images/adv_10_playing-a-game.png',
        video: '../video/adv_10_playing-a-game.mp4'
    }


]


